# DS_IsOpacityByClass

## Description
Returns whether document shadow opacity is by class.

```pascal
FUNCTION DS_IsOpacityByClass : BOOLEAN;
```

```python

def vs.DS_IsOpacityByClass():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2014
## Category
* Document Attributes